import { Apartment } from './apartment.model';

export class ApartmentService {
  private apartments: Apartment[] = [
    new Apartment(
      'קרית אתא',
      'הרצל',
      'דירה',
      66,
      2,
      5,
      137,
      1490000,
      'על הנחלה הנמצאת ביישוב עומר קיימים שני בתים למגורים במצב מצוין על שטח של שני דונם + נחלה חקלאית של שמונה ( עם מטע זיתים) מאחורי הבתים. גינה מטופחת מאוד, שערים חשמליים, חניות מרווחות',
      'https://img.yad2.co.il/Pic/202202/12/2_1/o/y2_1_03782_20220212180727.jpeg?l=5&c=3&w=195&h=117'
    ),

    new Apartment(
      'תל-אביב',
      'הרצל',
      'דירה',
      66,
      2,
      5,
      137,
      1490000,
      'על הנחלה הנמצאת ביישוב עומר קיימים שני בתים למגורים במצב מצוין על שטח של שני דונם + נחלה חקלאית של שמונה ( עם מטע זיתים) מאחורי הבתים. גינה מטופחת מאוד, שערים חשמליים, חניות מרווחות',
      'https://img.yad2.co.il/Pic/202202/12/2_1/o/y2_1_03782_20220212180727.jpeg?l=5&c=3&w=195&h=117'
    ),

    new Apartment(
      'נתיבות',
      'הרצל',
      'דירה',
      66,
      2,
      5,
      137,
      1490000,
      'על הנחלה הנמצאת ביישוב עומר קיימים שני בתים למגורים במצב מצוין על שטח של שני דונם + נחלה חקלאית של שמונה ( עם מטע זיתים) מאחורי הבתים. גינה מטופחת מאוד, שערים חשמליים, חניות מרווחות',
      'https://img.yad2.co.il/Pic/202202/12/2_1/o/y2_1_03782_20220212180727.jpeg?l=5&c=3&w=195&h=117'
    ),
  ];

  getApartments() {
    return this.apartments.slice();
  }
}
